vladimir-dudnik-1/u-boot/include/bl808/gpio_reg.h
/* 0x8C8 : gpio_cfg1 */
#define GLB_REG_GPIO_1_IE                                       (1<<0U)
#define GLB_REG_GPIO_1_SMT                                      (1<<1U)
#define GLB_REG_GPIO_1_DRV_SHIFT                                (2U)
#define GLB_REG_GPIO_1_DRV_MASK                                 (0x3<<GLB_REG_GPIO_1_DRV_SHIFT)
#define GLB_REG_GPIO_1_PU                                       (1<<4U)
#define GLB_REG_GPIO_1_PD                                       (1<<5U)
#define GLB_REG_GPIO_1_OE                                       (1<<6U)
#define GLB_REG_GPIO_1_FUNC_SEL_SHIFT                           (8U)
#define GLB_REG_GPIO_1_FUNC_SEL_MASK                            (0x1f<<GLB_REG_GPIO_1_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_1_INT_MODE_SET_SHIFT                       (16U)
#define GLB_REG_GPIO_1_INT_MODE_SET_MASK                        (0xf<<GLB_REG_GPIO_1_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_1_INT_CLR                                  (1<<20U)
#define GLB_GPIO_1_INT_STAT                                     (1<<21U)
#define GLB_REG_GPIO_1_INT_MASK                                 (1<<22U)
#define GLB_REG_GPIO_1_O                                        (1<<24U)
#define GLB_REG_GPIO_1_SET                                      (1<<25U)
#define GLB_REG_GPIO_1_CLR                                      (1<<26U)
#define GLB_REG_GPIO_1_I                                        (1<<28U)
#define GLB_REG_GPIO_1_MODE_SHIFT                               (30U)
#define GLB_REG_GPIO_1_MODE_MASK                                (0x3<<GLB_REG_GPIO_1_MODE_SHIFT)

/* 0x8CC : gpio_cfg2 */
#define GLB_REG_GPIO_2_IE                                       (1<<0U)
#define GLB_REG_GPIO_2_SMT                                      (1<<1U)
#define GLB_REG_GPIO_2_DRV_SHIFT                                (2U)
#define GLB_REG_GPIO_2_DRV_MASK                                 (0x3<<GLB_REG_GPIO_2_DRV_SHIFT)
#define GLB_REG_GPIO_2_PU                                       (1<<4U)
#define GLB_REG_GPIO_2_PD                                       (1<<5U)
#define GLB_REG_GPIO_2_OE                                       (1<<6U)
#define GLB_REG_GPIO_2_FUNC_SEL_SHIFT                           (8U)
#define GLB_REG_GPIO_2_FUNC_SEL_MASK                            (0x1f<<GLB_REG_GPIO_2_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_2_INT_MODE_SET_SHIFT                       (16U)
#define GLB_REG_GPIO_2_INT_MODE_SET_MASK                        (0xf<<GLB_REG_GPIO_2_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_2_INT_CLR                                  (1<<20U)
#define GLB_GPIO_2_INT_STAT                                     (1<<21U)
#define GLB_REG_GPIO_2_INT_MASK                                 (1<<22U)
#define GLB_REG_GPIO_2_O                                        (1<<24U)
#define GLB_REG_GPIO_2_SET                                      (1<<25U)
#define GLB_REG_GPIO_2_CLR                                      (1<<26U)
#define GLB_REG_GPIO_2_I                                        (1<<28U)
#define GLB_REG_GPIO_2_MODE_SHIFT                               (30U)
#define GLB_REG_GPIO_2_MODE_MASK                                (0x3<<GLB_REG_GPIO_2_MODE_SHIFT)

/* 0x8D0 : gpio_cfg3 */
#define GLB_REG_GPIO_3_IE                                       (1<<0U)
#define GLB_REG_GPIO_3_SMT                                      (1<<1U)
#define GLB_REG_GPIO_3_DRV_SHIFT                                (2U)
#define GLB_REG_GPIO_3_DRV_MASK                                 (0x3<<GLB_REG_GPIO_3_DRV_SHIFT)
#define GLB_REG_GPIO_3_PU                                       (1<<4U)
#define GLB_REG_GPIO_3_PD                                       (1<<5U)
#define GLB_REG_GPIO_3_OE                                       (1<<6U)
#define GLB_REG_GPIO_3_FUNC_SEL_SHIFT                           (8U)
#define GLB_REG_GPIO_3_FUNC_SEL_MASK                            (0x1f<<GLB_REG_GPIO_3_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_3_INT_MODE_SET_SHIFT                       (16U)
#define GLB_REG_GPIO_3_INT_MODE_SET_MASK                        (0xf<<GLB_REG_GPIO_3_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_3_INT_CLR                                  (1<<20U)
#define GLB_GPIO_3_INT_STAT                                     (1<<21U)
#define GLB_REG_GPIO_3_INT_MASK                                 (1<<22U)
#define GLB_REG_GPIO_3_O                                        (1<<24U)
#define GLB_REG_GPIO_3_SET                                      (1<<25U)
#define GLB_REG_GPIO_3_CLR                                      (1<<26U)
#define GLB_REG_GPIO_3_I                                        (1<<28U)
#define GLB_REG_GPIO_3_MODE_SHIFT                               (30U)
#define GLB_REG_GPIO_3_MODE_MASK                                (0x3<<GLB_REG_GPIO_3_MODE_SHIFT)

/* 0x8D4 : gpio_cfg4 */
#define GLB_REG_GPIO_4_IE                                       (1<<0U)
#define GLB_REG_GPIO_4_SMT                                      (1<<1U)
#define GLB_REG_GPIO_4_DRV_SHIFT                                (2U)
#define GLB_REG_GPIO_4_DRV_MASK                                 (0x3<<GLB_REG_GPIO_4_DRV_SHIFT)
#define GLB_REG_GPIO_4_PU                                       (1<<4U)
#define GLB_REG_GPIO_4_PD                                       (1<<5U)
#define GLB_REG_GPIO_4_OE                                       (1<<6U)
#define GLB_REG_GPIO_4_FUNC_SEL_SHIFT                           (8U)
#define GLB_REG_GPIO_4_FUNC_SEL_MASK                            (0x1f<<GLB_REG_GPIO_4_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_4_INT_MODE_SET_SHIFT                       (16U)
#define GLB_REG_GPIO_4_INT_MODE_SET_MASK                        (0xf<<GLB_REG_GPIO_4_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_4_INT_CLR                                  (1<<20U)
#define GLB_GPIO_4_INT_STAT                                     (1<<21U)
#define GLB_REG_GPIO_4_INT_MASK                                 (1<<22U)
#define GLB_REG_GPIO_4_O                                        (1<<24U)
#define GLB_REG_GPIO_4_SET                                      (1<<25U)
#define GLB_REG_GPIO_4_CLR                                      (1<<26U)
#define GLB_REG_GPIO_4_I                                        (1<<28U)
#define GLB_REG_GPIO_4_MODE_SHIFT                               (30U)
#define GLB_REG_GPIO_4_MODE_MASK                                (0x3<<GLB_REG_GPIO_4_MODE_SHIFT)

