vladimir-dudnik-1/u-boot/include/bl808/gpio_reg.h
/* 0x8D8 : gpio_cfg5 */
#define GLB_REG_GPIO_5_IE                                       (1<<0U)
#define GLB_REG_GPIO_5_SMT                                      (1<<1U)
#define GLB_REG_GPIO_5_DRV_SHIFT                                (2U)
#define GLB_REG_GPIO_5_DRV_MASK                                 (0x3<<GLB_REG_GPIO_5_DRV_SHIFT)
#define GLB_REG_GPIO_5_PU                                       (1<<4U)
#define GLB_REG_GPIO_5_PD                                       (1<<5U)
#define GLB_REG_GPIO_5_OE                                       (1<<6U)
#define GLB_REG_GPIO_5_FUNC_SEL_SHIFT                           (8U)
#define GLB_REG_GPIO_5_FUNC_SEL_MASK                            (0x1f<<GLB_REG_GPIO_5_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_5_INT_MODE_SET_SHIFT                       (16U)
#define GLB_REG_GPIO_5_INT_MODE_SET_MASK                        (0xf<<GLB_REG_GPIO_5_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_5_INT_CLR                                  (1<<20U)
#define GLB_GPIO_5_INT_STAT                                     (1<<21U)
#define GLB_REG_GPIO_5_INT_MASK                                 (1<<22U)
#define GLB_REG_GPIO_5_O                                        (1<<24U)
#define GLB_REG_GPIO_5_SET                                      (1<<25U)
#define GLB_REG_GPIO_5_CLR                                      (1<<26U)
#define GLB_REG_GPIO_5_I                                        (1<<28U)
#define GLB_REG_GPIO_5_MODE_SHIFT                               (30U)
#define GLB_REG_GPIO_5_MODE_MASK                                (0x3<<GLB_REG_GPIO_5_MODE_SHIFT)

/* 0x8DC : gpio_cfg6 */
#define GLB_REG_GPIO_6_IE                                       (1<<0U)
#define GLB_REG_GPIO_6_SMT                                      (1<<1U)
#define GLB_REG_GPIO_6_DRV_SHIFT                                (2U)
#define GLB_REG_GPIO_6_DRV_MASK                                 (0x3<<GLB_REG_GPIO_6_DRV_SHIFT)
#define GLB_REG_GPIO_6_PU                                       (1<<4U)
#define GLB_REG_GPIO_6_PD                                       (1<<5U)
#define GLB_REG_GPIO_6_OE                                       (1<<6U)
#define GLB_REG_GPIO_6_FUNC_SEL_SHIFT                           (8U)
#define GLB_REG_GPIO_6_FUNC_SEL_MASK                            (0x1f<<GLB_REG_GPIO_6_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_6_INT_MODE_SET_SHIFT                       (16U)
#define GLB_REG_GPIO_6_INT_MODE_SET_MASK                        (0xf<<GLB_REG_GPIO_6_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_6_INT_CLR                                  (1<<20U)
#define GLB_GPIO_6_INT_STAT                                     (1<<21U)
#define GLB_REG_GPIO_6_INT_MASK                                 (1<<22U)
#define GLB_REG_GPIO_6_O                                        (1<<24U)
#define GLB_REG_GPIO_6_SET                                      (1<<25U)
#define GLB_REG_GPIO_6_CLR                                      (1<<26U)
#define GLB_REG_GPIO_6_I                                        (1<<28U)
#define GLB_REG_GPIO_6_MODE_SHIFT                               (30U)
#define GLB_REG_GPIO_6_MODE_MASK                                (0x3<<GLB_REG_GPIO_6_MODE_SHIFT)

/* 0x8E0 : gpio_cfg7 */
#define GLB_REG_GPIO_7_IE                                       (1<<0U)
#define GLB_REG_GPIO_7_SMT                                      (1<<1U)
#define GLB_REG_GPIO_7_DRV_SHIFT                                (2U)
#define GLB_REG_GPIO_7_DRV_MASK                                 (0x3<<GLB_REG_GPIO_7_DRV_SHIFT)
#define GLB_REG_GPIO_7_PU                                       (1<<4U)
#define GLB_REG_GPIO_7_PD                                       (1<<5U)
#define GLB_REG_GPIO_7_OE                                       (1<<6U)
#define GLB_REG_GPIO_7_FUNC_SEL_SHIFT                           (8U)
#define GLB_REG_GPIO_7_FUNC_SEL_MASK                            (0x1f<<GLB_REG_GPIO_7_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_7_INT_MODE_SET_SHIFT                       (16U)
#define GLB_REG_GPIO_7_INT_MODE_SET_MASK                        (0xf<<GLB_REG_GPIO_7_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_7_INT_CLR                                  (1<<20U)
#define GLB_GPIO_7_INT_STAT                                     (1<<21U)
#define GLB_REG_GPIO_7_INT_MASK                                 (1<<22U)
#define GLB_REG_GPIO_7_O                                        (1<<24U)
#define GLB_REG_GPIO_7_SET                                      (1<<25U)
#define GLB_REG_GPIO_7_CLR                                      (1<<26U)
#define GLB_REG_GPIO_7_I                                        (1<<28U)
#define GLB_REG_GPIO_7_MODE_SHIFT                               (30U)
#define GLB_REG_GPIO_7_MODE_MASK                                (0x3<<GLB_REG_GPIO_7_MODE_SHIFT)

/* 0x8E4 : gpio_cfg8 */
#define GLB_REG_GPIO_8_IE                                       (1<<0U)
#define GLB_REG_GPIO_8_SMT                                      (1<<1U)
#define GLB_REG_GPIO_8_DRV_SHIFT                                (2U)
#define GLB_REG_GPIO_8_DRV_MASK                                 (0x3<<GLB_REG_GPIO_8_DRV_SHIFT)
#define GLB_REG_GPIO_8_PU                                       (1<<4U)
#define GLB_REG_GPIO_8_PD                                       (1<<5U)
#define GLB_REG_GPIO_8_OE                                       (1<<6U)
#define GLB_REG_GPIO_8_FUNC_SEL_SHIFT                           (8U)
#define GLB_REG_GPIO_8_FUNC_SEL_MASK                            (0x1f<<GLB_REG_GPIO_8_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_8_INT_MODE_SET_SHIFT                       (16U)
#define GLB_REG_GPIO_8_INT_MODE_SET_MASK                        (0xf<<GLB_REG_GPIO_8_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_8_INT_CLR                                  (1<<20U)
#define GLB_GPIO_8_INT_STAT                                     (1<<21U)
#define GLB_REG_GPIO_8_INT_MASK                                 (1<<22U)
#define GLB_REG_GPIO_8_O                                        (1<<24U)
#define GLB_REG_GPIO_8_SET                                      (1<<25U)
#define GLB_REG_GPIO_8_CLR                                      (1<<26U)
#define GLB_REG_GPIO_8_I                                        (1<<28U)
#define GLB_REG_GPIO_8_MODE_SHIFT                               (30U)
#define GLB_REG_GPIO_8_MODE_MASK                                (0x3<<GLB_REG_GPIO_8_MODE_SHIFT)

/* 0x8E8 : gpio_cfg9 */
#define GLB_REG_GPIO_9_IE                                       (1<<0U)
#define GLB_REG_GPIO_9_SMT                                      (1<<1U)
#define GLB_REG_GPIO_9_DRV_SHIFT                                (2U)
#define GLB_REG_GPIO_9_DRV_MASK                                 (0x3<<GLB_REG_GPIO_9_DRV_SHIFT)
#define GLB_REG_GPIO_9_PU                                       (1<<4U)
#define GLB_REG_GPIO_9_PD                                       (1<<5U)
#define GLB_REG_GPIO_9_OE                                       (1<<6U)
#define GLB_REG_GPIO_9_FUNC_SEL_SHIFT                           (8U)
#define GLB_REG_GPIO_9_FUNC_SEL_MASK                            (0x1f<<GLB_REG_GPIO_9_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_9_INT_MODE_SET_SHIFT                       (16U)
#define GLB_REG_GPIO_9_INT_MODE_SET_MASK                        (0xf<<GLB_REG_GPIO_9_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_9_INT_CLR                                  (1<<20U)
#define GLB_GPIO_9_INT_STAT                                     (1<<21U)
#define GLB_REG_GPIO_9_INT_MASK                                 (1<<22U)
#define GLB_REG_GPIO_9_O                                        (1<<24U)
#define GLB_REG_GPIO_9_SET                                      (1<<25U)
#define GLB_REG_GPIO_9_CLR                                      (1<<26U)
#define GLB_REG_GPIO_9_I                                        (1<<28U)
#define GLB_REG_GPIO_9_MODE_SHIFT                               (30U)
#define GLB_REG_GPIO_9_MODE_MASK                                (0x3<<GLB_REG_GPIO_9_MODE_SHIFT)

/* 0x8EC : gpio_cfg10 */
#define GLB_REG_GPIO_10_IE                                      (1<<0U)
#define GLB_REG_GPIO_10_SMT                                     (1<<1U)
#define GLB_REG_GPIO_10_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_10_DRV_MASK                                (0x3<<GLB_REG_GPIO_10_DRV_SHIFT)
#define GLB_REG_GPIO_10_PU                                      (1<<4U)
#define GLB_REG_GPIO_10_PD                                      (1<<5U)
#define GLB_REG_GPIO_10_OE                                      (1<<6U)
#define GLB_REG_GPIO_10_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_10_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_10_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_10_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_10_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_10_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_10_INT_CLR                                 (1<<20U)
#define GLB_GPIO_10_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_10_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_10_O                                       (1<<24U)
#define GLB_REG_GPIO_10_SET                                     (1<<25U)
#define GLB_REG_GPIO_10_CLR                                     (1<<26U)
#define GLB_REG_GPIO_10_I                                       (1<<28U)
#define GLB_REG_GPIO_10_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_10_MODE_MASK                               (0x3<<GLB_REG_GPIO_10_MODE_SHIFT)

/* 0x8F0 : gpio_cfg11 */
#define GLB_REG_GPIO_11_IE                                      (1<<0U)
#define GLB_REG_GPIO_11_SMT                                     (1<<1U)
#define GLB_REG_GPIO_11_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_11_DRV_MASK                                (0x3<<GLB_REG_GPIO_11_DRV_SHIFT)
#define GLB_REG_GPIO_11_PU                                      (1<<4U)
#define GLB_REG_GPIO_11_PD                                      (1<<5U)
#define GLB_REG_GPIO_11_OE                                      (1<<6U)
#define GLB_REG_GPIO_11_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_11_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_11_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_11_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_11_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_11_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_11_INT_CLR                                 (1<<20U)
#define GLB_GPIO_11_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_11_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_11_O                                       (1<<24U)
#define GLB_REG_GPIO_11_SET                                     (1<<25U)
#define GLB_REG_GPIO_11_CLR                                     (1<<26U)
#define GLB_REG_GPIO_11_I                                       (1<<28U)
#define GLB_REG_GPIO_11_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_11_MODE_MASK                               (0x3<<GLB_REG_GPIO_11_MODE_SHIFT)

