vladimir-dudnik-1/u-boot/include/bl808/gpio_reg.h
/* 0x8F4 : gpio_cfg12 */
#define GLB_REG_GPIO_12_IE                                      (1<<0U)
#define GLB_REG_GPIO_12_SMT                                     (1<<1U)
#define GLB_REG_GPIO_12_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_12_DRV_MASK                                (0x3<<GLB_REG_GPIO_12_DRV_SHIFT)
#define GLB_REG_GPIO_12_PU                                      (1<<4U)
#define GLB_REG_GPIO_12_PD                                      (1<<5U)
#define GLB_REG_GPIO_12_OE                                      (1<<6U)
#define GLB_REG_GPIO_12_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_12_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_12_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_12_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_12_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_12_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_12_INT_CLR                                 (1<<20U)
#define GLB_GPIO_12_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_12_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_12_O                                       (1<<24U)
#define GLB_REG_GPIO_12_SET                                     (1<<25U)
#define GLB_REG_GPIO_12_CLR                                     (1<<26U)
#define GLB_REG_GPIO_12_I                                       (1<<28U)
#define GLB_REG_GPIO_12_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_12_MODE_MASK                               (0x3<<GLB_REG_GPIO_12_MODE_SHIFT)

/* 0x8F8 : gpio_cfg13 */
#define GLB_REG_GPIO_13_IE                                      (1<<0U)
#define GLB_REG_GPIO_13_SMT                                     (1<<1U)
#define GLB_REG_GPIO_13_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_13_DRV_MASK                                (0x3<<GLB_REG_GPIO_13_DRV_SHIFT)
#define GLB_REG_GPIO_13_PU                                      (1<<4U)
#define GLB_REG_GPIO_13_PD                                      (1<<5U)
#define GLB_REG_GPIO_13_OE                                      (1<<6U)
#define GLB_REG_GPIO_13_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_13_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_13_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_13_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_13_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_13_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_13_INT_CLR                                 (1<<20U)
#define GLB_GPIO_13_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_13_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_13_O                                       (1<<24U)
#define GLB_REG_GPIO_13_SET                                     (1<<25U)
#define GLB_REG_GPIO_13_CLR                                     (1<<26U)
#define GLB_REG_GPIO_13_I                                       (1<<28U)
#define GLB_REG_GPIO_13_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_13_MODE_MASK                               (0x3<<GLB_REG_GPIO_13_MODE_SHIFT)

/* 0x8FC : gpio_cfg14 */
#define GLB_REG_GPIO_14_IE                                      (1<<0U)
#define GLB_REG_GPIO_14_SMT                                     (1<<1U)
#define GLB_REG_GPIO_14_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_14_DRV_MASK                                (0x3<<GLB_REG_GPIO_14_DRV_SHIFT)
#define GLB_REG_GPIO_14_PU                                      (1<<4U)
#define GLB_REG_GPIO_14_PD                                      (1<<5U)
#define GLB_REG_GPIO_14_OE                                      (1<<6U)
#define GLB_REG_GPIO_14_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_14_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_14_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_14_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_14_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_14_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_14_INT_CLR                                 (1<<20U)
#define GLB_GPIO_14_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_14_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_14_O                                       (1<<24U)
#define GLB_REG_GPIO_14_SET                                     (1<<25U)
#define GLB_REG_GPIO_14_CLR                                     (1<<26U)
#define GLB_REG_GPIO_14_I                                       (1<<28U)
#define GLB_REG_GPIO_14_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_14_MODE_MASK                               (0x3<<GLB_REG_GPIO_14_MODE_SHIFT)

/* 0x900 : gpio_cfg15 */
#define GLB_REG_GPIO_15_IE                                      (1<<0U)
#define GLB_REG_GPIO_15_SMT                                     (1<<1U)
#define GLB_REG_GPIO_15_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_15_DRV_MASK                                (0x3<<GLB_REG_GPIO_15_DRV_SHIFT)
#define GLB_REG_GPIO_15_PU                                      (1<<4U)
#define GLB_REG_GPIO_15_PD                                      (1<<5U)
#define GLB_REG_GPIO_15_OE                                      (1<<6U)
#define GLB_REG_GPIO_15_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_15_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_15_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_15_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_15_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_15_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_15_INT_CLR                                 (1<<20U)
#define GLB_GPIO_15_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_15_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_15_O                                       (1<<24U)
#define GLB_REG_GPIO_15_SET                                     (1<<25U)
#define GLB_REG_GPIO_15_CLR                                     (1<<26U)
#define GLB_REG_GPIO_15_I                                       (1<<28U)
#define GLB_REG_GPIO_15_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_15_MODE_MASK                               (0x3<<GLB_REG_GPIO_15_MODE_SHIFT)

/* 0x904 : gpio_cfg16 */
#define GLB_REG_GPIO_16_IE                                      (1<<0U)
#define GLB_REG_GPIO_16_SMT                                     (1<<1U)
#define GLB_REG_GPIO_16_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_16_DRV_MASK                                (0x3<<GLB_REG_GPIO_16_DRV_SHIFT)
#define GLB_REG_GPIO_16_PU                                      (1<<4U)
#define GLB_REG_GPIO_16_PD                                      (1<<5U)
#define GLB_REG_GPIO_16_OE                                      (1<<6U)
#define GLB_REG_GPIO_16_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_16_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_16_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_16_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_16_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_16_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_16_INT_CLR                                 (1<<20U)
#define GLB_GPIO_16_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_16_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_16_O                                       (1<<24U)
#define GLB_REG_GPIO_16_SET                                     (1<<25U)
#define GLB_REG_GPIO_16_CLR                                     (1<<26U)
#define GLB_REG_GPIO_16_I                                       (1<<28U)
#define GLB_REG_GPIO_16_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_16_MODE_MASK                               (0x3<<GLB_REG_GPIO_16_MODE_SHIFT)

/* 0x908 : gpio_cfg17 */
#define GLB_REG_GPIO_17_IE                                      (1<<0U)
#define GLB_REG_GPIO_17_SMT                                     (1<<1U)
#define GLB_REG_GPIO_17_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_17_DRV_MASK                                (0x3<<GLB_REG_GPIO_17_DRV_SHIFT)
#define GLB_REG_GPIO_17_PU                                      (1<<4U)
#define GLB_REG_GPIO_17_PD                                      (1<<5U)
#define GLB_REG_GPIO_17_OE                                      (1<<6U)
#define GLB_REG_GPIO_17_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_17_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_17_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_17_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_17_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_17_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_17_INT_CLR                                 (1<<20U)
#define GLB_GPIO_17_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_17_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_17_O                                       (1<<24U)
#define GLB_REG_GPIO_17_SET                                     (1<<25U)
#define GLB_REG_GPIO_17_CLR                                     (1<<26U)
#define GLB_REG_GPIO_17_I                                       (1<<28U)
#define GLB_REG_GPIO_17_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_17_MODE_MASK                               (0x3<<GLB_REG_GPIO_17_MODE_SHIFT)

/* 0x90C : gpio_cfg18 */
#define GLB_REG_GPIO_18_IE                                      (1<<0U)
#define GLB_REG_GPIO_18_SMT                                     (1<<1U)
#define GLB_REG_GPIO_18_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_18_DRV_MASK                                (0x3<<GLB_REG_GPIO_18_DRV_SHIFT)
#define GLB_REG_GPIO_18_PU                                      (1<<4U)
#define GLB_REG_GPIO_18_PD                                      (1<<5U)
#define GLB_REG_GPIO_18_OE                                      (1<<6U)
#define GLB_REG_GPIO_18_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_18_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_18_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_18_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_18_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_18_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_18_INT_CLR                                 (1<<20U)
#define GLB_GPIO_18_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_18_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_18_O                                       (1<<24U)
#define GLB_REG_GPIO_18_SET                                     (1<<25U)
#define GLB_REG_GPIO_18_CLR                                     (1<<26U)
#define GLB_REG_GPIO_18_I                                       (1<<28U)
#define GLB_REG_GPIO_18_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_18_MODE_MASK                               (0x3<<GLB_REG_GPIO_18_MODE_SHIFT)

/* 0x910 : gpio_cfg19 */
#define GLB_REG_GPIO_19_IE                                      (1<<0U)
#define GLB_REG_GPIO_19_SMT                                     (1<<1U)
#define GLB_REG_GPIO_19_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_19_DRV_MASK                                (0x3<<GLB_REG_GPIO_19_DRV_SHIFT)
#define GLB_REG_GPIO_19_PU                                      (1<<4U)
#define GLB_REG_GPIO_19_PD                                      (1<<5U)
#define GLB_REG_GPIO_19_OE                                      (1<<6U)
#define GLB_REG_GPIO_19_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_19_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_19_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_19_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_19_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_19_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_19_INT_CLR                                 (1<<20U)
#define GLB_GPIO_19_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_19_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_19_O                                       (1<<24U)
#define GLB_REG_GPIO_19_SET                                     (1<<25U)
#define GLB_REG_GPIO_19_CLR                                     (1<<26U)
#define GLB_REG_GPIO_19_I                                       (1<<28U)
#define GLB_REG_GPIO_19_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_19_MODE_MASK                               (0x3<<GLB_REG_GPIO_19_MODE_SHIFT)

/* 0x914 : gpio_cfg20 */
#define GLB_REG_GPIO_20_IE                                      (1<<0U)
#define GLB_REG_GPIO_20_SMT                                     (1<<1U)
#define GLB_REG_GPIO_20_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_20_DRV_MASK                                (0x3<<GLB_REG_GPIO_20_DRV_SHIFT)
#define GLB_REG_GPIO_20_PU                                      (1<<4U)
#define GLB_REG_GPIO_20_PD                                      (1<<5U)
#define GLB_REG_GPIO_20_OE                                      (1<<6U)
#define GLB_REG_GPIO_20_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_20_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_20_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_20_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_20_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_20_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_20_INT_CLR                                 (1<<20U)
#define GLB_GPIO_20_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_20_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_20_O                                       (1<<24U)
#define GLB_REG_GPIO_20_SET                                     (1<<25U)
#define GLB_REG_GPIO_20_CLR                                     (1<<26U)
#define GLB_REG_GPIO_20_I                                       (1<<28U)
#define GLB_REG_GPIO_20_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_20_MODE_MASK                               (0x3<<GLB_REG_GPIO_20_MODE_SHIFT)

/* 0x918 : gpio_cfg21 */
#define GLB_REG_GPIO_21_IE                                      (1<<0U)
#define GLB_REG_GPIO_21_SMT                                     (1<<1U)
#define GLB_REG_GPIO_21_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_21_DRV_MASK                                (0x3<<GLB_REG_GPIO_21_DRV_SHIFT)
#define GLB_REG_GPIO_21_PU                                      (1<<4U)
#define GLB_REG_GPIO_21_PD                                      (1<<5U)
#define GLB_REG_GPIO_21_OE                                      (1<<6U)
#define GLB_REG_GPIO_21_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_21_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_21_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_21_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_21_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_21_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_21_INT_CLR                                 (1<<20U)
#define GLB_GPIO_21_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_21_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_21_O                                       (1<<24U)
#define GLB_REG_GPIO_21_SET                                     (1<<25U)
#define GLB_REG_GPIO_21_CLR                                     (1<<26U)
#define GLB_REG_GPIO_21_I                                       (1<<28U)
#define GLB_REG_GPIO_21_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_21_MODE_MASK                               (0x3<<GLB_REG_GPIO_21_MODE_SHIFT)

