vladimir-dudnik-1/u-boot/include/bl808/gpio_reg.h
/* 0x91C : gpio_cfg22 */
#define GLB_REG_GPIO_22_IE                                      (1<<0U)
#define GLB_REG_GPIO_22_SMT                                     (1<<1U)
#define GLB_REG_GPIO_22_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_22_DRV_MASK                                (0x3<<GLB_REG_GPIO_22_DRV_SHIFT)
#define GLB_REG_GPIO_22_PU                                      (1<<4U)
#define GLB_REG_GPIO_22_PD                                      (1<<5U)
#define GLB_REG_GPIO_22_OE                                      (1<<6U)
#define GLB_REG_GPIO_22_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_22_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_22_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_22_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_22_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_22_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_22_INT_CLR                                 (1<<20U)
#define GLB_GPIO_22_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_22_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_22_O                                       (1<<24U)
#define GLB_REG_GPIO_22_SET                                     (1<<25U)
#define GLB_REG_GPIO_22_CLR                                     (1<<26U)
#define GLB_REG_GPIO_22_I                                       (1<<28U)
#define GLB_REG_GPIO_22_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_22_MODE_MASK                               (0x3<<GLB_REG_GPIO_22_MODE_SHIFT)

/* 0x920 : gpio_cfg23 */
#define GLB_REG_GPIO_23_IE                                      (1<<0U)
#define GLB_REG_GPIO_23_SMT                                     (1<<1U)
#define GLB_REG_GPIO_23_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_23_DRV_MASK                                (0x3<<GLB_REG_GPIO_23_DRV_SHIFT)
#define GLB_REG_GPIO_23_PU                                      (1<<4U)
#define GLB_REG_GPIO_23_PD                                      (1<<5U)
#define GLB_REG_GPIO_23_OE                                      (1<<6U)
#define GLB_REG_GPIO_23_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_23_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_23_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_23_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_23_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_23_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_23_INT_CLR                                 (1<<20U)
#define GLB_GPIO_23_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_23_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_23_O                                       (1<<24U)
#define GLB_REG_GPIO_23_SET                                     (1<<25U)
#define GLB_REG_GPIO_23_CLR                                     (1<<26U)
#define GLB_REG_GPIO_23_I                                       (1<<28U)
#define GLB_REG_GPIO_23_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_23_MODE_MASK                               (0x3<<GLB_REG_GPIO_23_MODE_SHIFT)

/* 0x924 : gpio_cfg24 */
#define GLB_REG_GPIO_24_IE                                      (1<<0U)
#define GLB_REG_GPIO_24_SMT                                     (1<<1U)
#define GLB_REG_GPIO_24_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_24_DRV_MASK                                (0x3<<GLB_REG_GPIO_24_DRV_SHIFT)
#define GLB_REG_GPIO_24_PU                                      (1<<4U)
#define GLB_REG_GPIO_24_PD                                      (1<<5U)
#define GLB_REG_GPIO_24_OE                                      (1<<6U)
#define GLB_REG_GPIO_24_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_24_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_24_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_24_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_24_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_24_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_24_INT_CLR                                 (1<<20U)
#define GLB_GPIO_24_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_24_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_24_O                                       (1<<24U)
#define GLB_REG_GPIO_24_SET                                     (1<<25U)
#define GLB_REG_GPIO_24_CLR                                     (1<<26U)
#define GLB_REG_GPIO_24_I                                       (1<<28U)
#define GLB_REG_GPIO_24_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_24_MODE_MASK                               (0x3<<GLB_REG_GPIO_24_MODE_SHIFT)

/* 0x928 : gpio_cfg25 */
#define GLB_REG_GPIO_25_IE                                      (1<<0U)
#define GLB_REG_GPIO_25_SMT                                     (1<<1U)
#define GLB_REG_GPIO_25_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_25_DRV_MASK                                (0x3<<GLB_REG_GPIO_25_DRV_SHIFT)
#define GLB_REG_GPIO_25_PU                                      (1<<4U)
#define GLB_REG_GPIO_25_PD                                      (1<<5U)
#define GLB_REG_GPIO_25_OE                                      (1<<6U)
#define GLB_REG_GPIO_25_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_25_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_25_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_25_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_25_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_25_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_25_INT_CLR                                 (1<<20U)
#define GLB_GPIO_25_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_25_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_25_O                                       (1<<24U)
#define GLB_REG_GPIO_25_SET                                     (1<<25U)
#define GLB_REG_GPIO_25_CLR                                     (1<<26U)
#define GLB_REG_GPIO_25_I                                       (1<<28U)
#define GLB_REG_GPIO_25_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_25_MODE_MASK                               (0x3<<GLB_REG_GPIO_25_MODE_SHIFT)

/* 0x92C : gpio_cfg26 */
#define GLB_REG_GPIO_26_IE                                      (1<<0U)
#define GLB_REG_GPIO_26_SMT                                     (1<<1U)
#define GLB_REG_GPIO_26_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_26_DRV_MASK                                (0x3<<GLB_REG_GPIO_26_DRV_SHIFT)
#define GLB_REG_GPIO_26_PU                                      (1<<4U)
#define GLB_REG_GPIO_26_PD                                      (1<<5U)
#define GLB_REG_GPIO_26_OE                                      (1<<6U)
#define GLB_REG_GPIO_26_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_26_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_26_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_26_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_26_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_26_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_26_INT_CLR                                 (1<<20U)
#define GLB_GPIO_26_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_26_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_26_O                                       (1<<24U)
#define GLB_REG_GPIO_26_SET                                     (1<<25U)
#define GLB_REG_GPIO_26_CLR                                     (1<<26U)
#define GLB_REG_GPIO_26_I                                       (1<<28U)
#define GLB_REG_GPIO_26_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_26_MODE_MASK                               (0x3<<GLB_REG_GPIO_26_MODE_SHIFT)

/* 0x930 : gpio_cfg27 */
#define GLB_REG_GPIO_27_IE                                      (1<<0U)
#define GLB_REG_GPIO_27_SMT                                     (1<<1U)
#define GLB_REG_GPIO_27_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_27_DRV_MASK                                (0x3<<GLB_REG_GPIO_27_DRV_SHIFT)
#define GLB_REG_GPIO_27_PU                                      (1<<4U)
#define GLB_REG_GPIO_27_PD                                      (1<<5U)
#define GLB_REG_GPIO_27_OE                                      (1<<6U)
#define GLB_REG_GPIO_27_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_27_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_27_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_27_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_27_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_27_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_27_INT_CLR                                 (1<<20U)
#define GLB_GPIO_27_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_27_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_27_O                                       (1<<24U)
#define GLB_REG_GPIO_27_SET                                     (1<<25U)
#define GLB_REG_GPIO_27_CLR                                     (1<<26U)
#define GLB_REG_GPIO_27_I                                       (1<<28U)
#define GLB_REG_GPIO_27_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_27_MODE_MASK                               (0x3<<GLB_REG_GPIO_27_MODE_SHIFT)

/* 0x934 : gpio_cfg28 */
#define GLB_REG_GPIO_28_IE                                      (1<<0U)
#define GLB_REG_GPIO_28_SMT                                     (1<<1U)
#define GLB_REG_GPIO_28_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_28_DRV_MASK                                (0x3<<GLB_REG_GPIO_28_DRV_SHIFT)
#define GLB_REG_GPIO_28_PU                                      (1<<4U)
#define GLB_REG_GPIO_28_PD                                      (1<<5U)
#define GLB_REG_GPIO_28_OE                                      (1<<6U)
#define GLB_REG_GPIO_28_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_28_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_28_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_28_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_28_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_28_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_28_INT_CLR                                 (1<<20U)
#define GLB_GPIO_28_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_28_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_28_O                                       (1<<24U)
#define GLB_REG_GPIO_28_SET                                     (1<<25U)
#define GLB_REG_GPIO_28_CLR                                     (1<<26U)
#define GLB_REG_GPIO_28_I                                       (1<<28U)
#define GLB_REG_GPIO_28_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_28_MODE_MASK                               (0x3<<GLB_REG_GPIO_28_MODE_SHIFT)

/* 0x938 : gpio_cfg29 */
#define GLB_REG_GPIO_29_IE                                      (1<<0U)
#define GLB_REG_GPIO_29_SMT                                     (1<<1U)
#define GLB_REG_GPIO_29_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_29_DRV_MASK                                (0x3<<GLB_REG_GPIO_29_DRV_SHIFT)
#define GLB_REG_GPIO_29_PU                                      (1<<4U)
#define GLB_REG_GPIO_29_PD                                      (1<<5U)
#define GLB_REG_GPIO_29_OE                                      (1<<6U)
#define GLB_REG_GPIO_29_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_29_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_29_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_29_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_29_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_29_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_29_INT_CLR                                 (1<<20U)
#define GLB_GPIO_29_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_29_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_29_O                                       (1<<24U)
#define GLB_REG_GPIO_29_SET                                     (1<<25U)
#define GLB_REG_GPIO_29_CLR                                     (1<<26U)
#define GLB_REG_GPIO_29_I                                       (1<<28U)
#define GLB_REG_GPIO_29_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_29_MODE_MASK                               (0x3<<GLB_REG_GPIO_29_MODE_SHIFT)

