vladimir-dudnik-1/u-boot/include/bl808/gpio_reg.h
/* 0x93C : gpio_cfg30 */
#define GLB_REG_GPIO_30_IE                                      (1<<0U)
#define GLB_REG_GPIO_30_SMT                                     (1<<1U)
#define GLB_REG_GPIO_30_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_30_DRV_MASK                                (0x3<<GLB_REG_GPIO_30_DRV_SHIFT)
#define GLB_REG_GPIO_30_PU                                      (1<<4U)
#define GLB_REG_GPIO_30_PD                                      (1<<5U)
#define GLB_REG_GPIO_30_OE                                      (1<<6U)
#define GLB_REG_GPIO_30_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_30_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_30_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_30_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_30_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_30_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_30_INT_CLR                                 (1<<20U)
#define GLB_GPIO_30_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_30_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_30_O                                       (1<<24U)
#define GLB_REG_GPIO_30_SET                                     (1<<25U)
#define GLB_REG_GPIO_30_CLR                                     (1<<26U)
#define GLB_REG_GPIO_30_I                                       (1<<28U)
#define GLB_REG_GPIO_30_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_30_MODE_MASK                               (0x3<<GLB_REG_GPIO_30_MODE_SHIFT)

/* 0x940 : gpio_cfg31 */
#define GLB_REG_GPIO_31_IE                                      (1<<0U)
#define GLB_REG_GPIO_31_SMT                                     (1<<1U)
#define GLB_REG_GPIO_31_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_31_DRV_MASK                                (0x3<<GLB_REG_GPIO_31_DRV_SHIFT)
#define GLB_REG_GPIO_31_PU                                      (1<<4U)
#define GLB_REG_GPIO_31_PD                                      (1<<5U)
#define GLB_REG_GPIO_31_OE                                      (1<<6U)
#define GLB_REG_GPIO_31_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_31_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_31_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_31_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_31_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_31_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_31_INT_CLR                                 (1<<20U)
#define GLB_GPIO_31_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_31_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_31_O                                       (1<<24U)
#define GLB_REG_GPIO_31_SET                                     (1<<25U)
#define GLB_REG_GPIO_31_CLR                                     (1<<26U)
#define GLB_REG_GPIO_31_I                                       (1<<28U)
#define GLB_REG_GPIO_31_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_31_MODE_MASK                               (0x3<<GLB_REG_GPIO_31_MODE_SHIFT)

/* 0x944 : gpio_cfg32 */
#define GLB_REG_GPIO_32_IE                                      (1<<0U)
#define GLB_REG_GPIO_32_SMT                                     (1<<1U)
#define GLB_REG_GPIO_32_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_32_DRV_MASK                                (0x3<<GLB_REG_GPIO_32_DRV_SHIFT)
#define GLB_REG_GPIO_32_PU                                      (1<<4U)
#define GLB_REG_GPIO_32_PD                                      (1<<5U)
#define GLB_REG_GPIO_32_OE                                      (1<<6U)
#define GLB_REG_GPIO_32_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_32_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_32_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_32_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_32_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_32_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_32_INT_CLR                                 (1<<20U)
#define GLB_GPIO_32_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_32_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_32_O                                       (1<<24U)
#define GLB_REG_GPIO_32_SET                                     (1<<25U)
#define GLB_REG_GPIO_32_CLR                                     (1<<26U)
#define GLB_REG_GPIO_32_I                                       (1<<28U)
#define GLB_REG_GPIO_32_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_32_MODE_MASK                               (0x3<<GLB_REG_GPIO_32_MODE_SHIFT)

/* 0x948 : gpio_cfg33 */
#define GLB_REG_GPIO_33_IE                                      (1<<0U)
#define GLB_REG_GPIO_33_SMT                                     (1<<1U)
#define GLB_REG_GPIO_33_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_33_DRV_MASK                                (0x3<<GLB_REG_GPIO_33_DRV_SHIFT)
#define GLB_REG_GPIO_33_PU                                      (1<<4U)
#define GLB_REG_GPIO_33_PD                                      (1<<5U)
#define GLB_REG_GPIO_33_OE                                      (1<<6U)
#define GLB_REG_GPIO_33_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_33_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_33_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_33_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_33_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_33_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_33_INT_CLR                                 (1<<20U)
#define GLB_GPIO_33_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_33_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_33_O                                       (1<<24U)
#define GLB_REG_GPIO_33_SET                                     (1<<25U)
#define GLB_REG_GPIO_33_CLR                                     (1<<26U)
#define GLB_REG_GPIO_33_I                                       (1<<28U)
#define GLB_REG_GPIO_33_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_33_MODE_MASK                               (0x3<<GLB_REG_GPIO_33_MODE_SHIFT)

/* 0x94C : gpio_cfg34 */
#define GLB_REG_GPIO_34_IE                                      (1<<0U)
#define GLB_REG_GPIO_34_SMT                                     (1<<1U)
#define GLB_REG_GPIO_34_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_34_DRV_MASK                                (0x3<<GLB_REG_GPIO_34_DRV_SHIFT)
#define GLB_REG_GPIO_34_PU                                      (1<<4U)
#define GLB_REG_GPIO_34_PD                                      (1<<5U)
#define GLB_REG_GPIO_34_OE                                      (1<<6U)
#define GLB_REG_GPIO_34_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_34_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_34_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_34_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_34_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_34_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_34_INT_CLR                                 (1<<20U)
#define GLB_GPIO_34_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_34_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_34_O                                       (1<<24U)
#define GLB_REG_GPIO_34_SET                                     (1<<25U)
#define GLB_REG_GPIO_34_CLR                                     (1<<26U)
#define GLB_REG_GPIO_34_I                                       (1<<28U)
#define GLB_REG_GPIO_34_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_34_MODE_MASK                               (0x3<<GLB_REG_GPIO_34_MODE_SHIFT)

