vladimir-dudnik-1/u-boot/include/bl808/gpio_reg.h
/* 0x950 : gpio_cfg35 */
#define GLB_REG_GPIO_35_IE                                      (1<<0U)
#define GLB_REG_GPIO_35_SMT                                     (1<<1U)
#define GLB_REG_GPIO_35_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_35_DRV_MASK                                (0x3<<GLB_REG_GPIO_35_DRV_SHIFT)
#define GLB_REG_GPIO_35_PU                                      (1<<4U)
#define GLB_REG_GPIO_35_PD                                      (1<<5U)
#define GLB_REG_GPIO_35_OE                                      (1<<6U)
#define GLB_REG_GPIO_35_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_35_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_35_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_35_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_35_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_35_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_35_INT_CLR                                 (1<<20U)
#define GLB_GPIO_35_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_35_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_35_O                                       (1<<24U)
#define GLB_REG_GPIO_35_SET                                     (1<<25U)
#define GLB_REG_GPIO_35_CLR                                     (1<<26U)
#define GLB_REG_GPIO_35_I                                       (1<<28U)
#define GLB_REG_GPIO_35_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_35_MODE_MASK                               (0x3<<GLB_REG_GPIO_35_MODE_SHIFT)

/* 0x954 : gpio_cfg36 */
#define GLB_REG_GPIO_36_IE                                      (1<<0U)
#define GLB_REG_GPIO_36_SMT                                     (1<<1U)
#define GLB_REG_GPIO_36_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_36_DRV_MASK                                (0x3<<GLB_REG_GPIO_36_DRV_SHIFT)
#define GLB_REG_GPIO_36_PU                                      (1<<4U)
#define GLB_REG_GPIO_36_PD                                      (1<<5U)
#define GLB_REG_GPIO_36_OE                                      (1<<6U)
#define GLB_REG_GPIO_36_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_36_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_36_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_36_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_36_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_36_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_36_INT_CLR                                 (1<<20U)
#define GLB_GPIO_36_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_36_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_36_O                                       (1<<24U)
#define GLB_REG_GPIO_36_SET                                     (1<<25U)
#define GLB_REG_GPIO_36_CLR                                     (1<<26U)
#define GLB_REG_GPIO_36_I                                       (1<<28U)
#define GLB_REG_GPIO_36_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_36_MODE_MASK                               (0x3<<GLB_REG_GPIO_36_MODE_SHIFT)

/* 0x958 : gpio_cfg37 */
#define GLB_REG_GPIO_37_IE                                      (1<<0U)
#define GLB_REG_GPIO_37_SMT                                     (1<<1U)
#define GLB_REG_GPIO_37_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_37_DRV_MASK                                (0x3<<GLB_REG_GPIO_37_DRV_SHIFT)
#define GLB_REG_GPIO_37_PU                                      (1<<4U)
#define GLB_REG_GPIO_37_PD                                      (1<<5U)
#define GLB_REG_GPIO_37_OE                                      (1<<6U)
#define GLB_REG_GPIO_37_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_37_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_37_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_37_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_37_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_37_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_37_INT_CLR                                 (1<<20U)
#define GLB_GPIO_37_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_37_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_37_O                                       (1<<24U)
#define GLB_REG_GPIO_37_SET                                     (1<<25U)
#define GLB_REG_GPIO_37_CLR                                     (1<<26U)
#define GLB_REG_GPIO_37_I                                       (1<<28U)
#define GLB_REG_GPIO_37_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_37_MODE_MASK                               (0x3<<GLB_REG_GPIO_37_MODE_SHIFT)

/* 0x95C : gpio_cfg38 */
#define GLB_REG_GPIO_38_IE                                      (1<<0U)
#define GLB_REG_GPIO_38_SMT                                     (1<<1U)
#define GLB_REG_GPIO_38_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_38_DRV_MASK                                (0x3<<GLB_REG_GPIO_38_DRV_SHIFT)
#define GLB_REG_GPIO_38_PU                                      (1<<4U)
#define GLB_REG_GPIO_38_PD                                      (1<<5U)
#define GLB_REG_GPIO_38_OE                                      (1<<6U)
#define GLB_REG_GPIO_38_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_38_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_38_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_38_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_38_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_38_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_38_INT_CLR                                 (1<<20U)
#define GLB_GPIO_38_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_38_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_38_O                                       (1<<24U)
#define GLB_REG_GPIO_38_SET                                     (1<<25U)
#define GLB_REG_GPIO_38_CLR                                     (1<<26U)
#define GLB_REG_GPIO_38_I                                       (1<<28U)
#define GLB_REG_GPIO_38_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_38_MODE_MASK                               (0x3<<GLB_REG_GPIO_38_MODE_SHIFT)

/* 0x960 : gpio_cfg39 */
#define GLB_REG_GPIO_39_IE                                      (1<<0U)
#define GLB_REG_GPIO_39_SMT                                     (1<<1U)
#define GLB_REG_GPIO_39_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_39_DRV_MASK                                (0x3<<GLB_REG_GPIO_39_DRV_SHIFT)
#define GLB_REG_GPIO_39_PU                                      (1<<4U)
#define GLB_REG_GPIO_39_PD                                      (1<<5U)
#define GLB_REG_GPIO_39_OE                                      (1<<6U)
#define GLB_REG_GPIO_39_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_39_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_39_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_39_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_39_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_39_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_39_INT_CLR                                 (1<<20U)
#define GLB_GPIO_39_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_39_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_39_O                                       (1<<24U)
#define GLB_REG_GPIO_39_SET                                     (1<<25U)
#define GLB_REG_GPIO_39_CLR                                     (1<<26U)
#define GLB_REG_GPIO_39_I                                       (1<<28U)
#define GLB_REG_GPIO_39_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_39_MODE_MASK                               (0x3<<GLB_REG_GPIO_39_MODE_SHIFT)

/* 0x964 : gpio_cfg40 */
#define GLB_REG_GPIO_40_IE                                      (1<<0U)
#define GLB_REG_GPIO_40_SMT                                     (1<<1U)
#define GLB_REG_GPIO_40_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_40_DRV_MASK                                (0x3<<GLB_REG_GPIO_40_DRV_SHIFT)
#define GLB_REG_GPIO_40_PU                                      (1<<4U)
#define GLB_REG_GPIO_40_PD                                      (1<<5U)
#define GLB_REG_GPIO_40_OE                                      (1<<6U)
#define GLB_REG_GPIO_40_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_40_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_40_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_40_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_40_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_40_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_40_INT_CLR                                 (1<<20U)
#define GLB_GPIO_40_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_40_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_40_O                                       (1<<24U)
#define GLB_REG_GPIO_40_SET                                     (1<<25U)
#define GLB_REG_GPIO_40_CLR                                     (1<<26U)
#define GLB_REG_GPIO_40_I                                       (1<<28U)
#define GLB_REG_GPIO_40_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_40_MODE_MASK                               (0x3<<GLB_REG_GPIO_40_MODE_SHIFT)

/* 0x968 : gpio_cfg41 */
#define GLB_REG_GPIO_41_IE                                      (1<<0U)
#define GLB_REG_GPIO_41_SMT                                     (1<<1U)
#define GLB_REG_GPIO_41_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_41_DRV_MASK                                (0x3<<GLB_REG_GPIO_41_DRV_SHIFT)
#define GLB_REG_GPIO_41_PU                                      (1<<4U)
#define GLB_REG_GPIO_41_PD                                      (1<<5U)
#define GLB_REG_GPIO_41_OE                                      (1<<6U)
#define GLB_REG_GPIO_41_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_41_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_41_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_41_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_41_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_41_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_41_INT_CLR                                 (1<<20U)
#define GLB_GPIO_41_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_41_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_41_O                                       (1<<24U)
#define GLB_REG_GPIO_41_SET                                     (1<<25U)
#define GLB_REG_GPIO_41_CLR                                     (1<<26U)
#define GLB_REG_GPIO_41_I                                       (1<<28U)
#define GLB_REG_GPIO_41_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_41_MODE_MASK                               (0x3<<GLB_REG_GPIO_41_MODE_SHIFT)

