vladimir-dudnik-1/u-boot/include/bl808/gpio_reg.h
/* 0x96C : gpio_cfg42 */
#define GLB_REG_GPIO_42_IE                                      (1<<0U)
#define GLB_REG_GPIO_42_SMT                                     (1<<1U)
#define GLB_REG_GPIO_42_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_42_DRV_MASK                                (0x3<<GLB_REG_GPIO_42_DRV_SHIFT)
#define GLB_REG_GPIO_42_PU                                      (1<<4U)
#define GLB_REG_GPIO_42_PD                                      (1<<5U)
#define GLB_REG_GPIO_42_OE                                      (1<<6U)
#define GLB_REG_GPIO_42_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_42_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_42_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_42_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_42_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_42_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_42_INT_CLR                                 (1<<20U)
#define GLB_GPIO_42_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_42_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_42_O                                       (1<<24U)
#define GLB_REG_GPIO_42_SET                                     (1<<25U)
#define GLB_REG_GPIO_42_CLR                                     (1<<26U)
#define GLB_REG_GPIO_42_I                                       (1<<28U)
#define GLB_REG_GPIO_42_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_42_MODE_MASK                               (0x3<<GLB_REG_GPIO_42_MODE_SHIFT)

/* 0x970 : gpio_cfg43 */
#define GLB_REG_GPIO_43_IE                                      (1<<0U)
#define GLB_REG_GPIO_43_SMT                                     (1<<1U)
#define GLB_REG_GPIO_43_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_43_DRV_MASK                                (0x3<<GLB_REG_GPIO_43_DRV_SHIFT)
#define GLB_REG_GPIO_43_PU                                      (1<<4U)
#define GLB_REG_GPIO_43_PD                                      (1<<5U)
#define GLB_REG_GPIO_43_OE                                      (1<<6U)
#define GLB_REG_GPIO_43_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_43_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_43_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_43_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_43_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_43_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_43_INT_CLR                                 (1<<20U)
#define GLB_GPIO_43_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_43_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_43_O                                       (1<<24U)
#define GLB_REG_GPIO_43_SET                                     (1<<25U)
#define GLB_REG_GPIO_43_CLR                                     (1<<26U)
#define GLB_REG_GPIO_43_I                                       (1<<28U)
#define GLB_REG_GPIO_43_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_43_MODE_MASK                               (0x3<<GLB_REG_GPIO_43_MODE_SHIFT)

/* 0x974 : gpio_cfg44 */
#define GLB_REG_GPIO_44_IE                                      (1<<0U)
#define GLB_REG_GPIO_44_SMT                                     (1<<1U)
#define GLB_REG_GPIO_44_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_44_DRV_MASK                                (0x3<<GLB_REG_GPIO_44_DRV_SHIFT)
#define GLB_REG_GPIO_44_PU                                      (1<<4U)
#define GLB_REG_GPIO_44_PD                                      (1<<5U)
#define GLB_REG_GPIO_44_OE                                      (1<<6U)
#define GLB_REG_GPIO_44_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_44_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_44_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_44_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_44_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_44_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_44_INT_CLR                                 (1<<20U)
#define GLB_GPIO_44_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_44_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_44_O                                       (1<<24U)
#define GLB_REG_GPIO_44_SET                                     (1<<25U)
#define GLB_REG_GPIO_44_CLR                                     (1<<26U)
#define GLB_REG_GPIO_44_I                                       (1<<28U)
#define GLB_REG_GPIO_44_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_44_MODE_MASK                               (0x3<<GLB_REG_GPIO_44_MODE_SHIFT)

/* 0x978 : gpio_cfg45 */
#define GLB_REG_GPIO_45_IE                                      (1<<0U)
#define GLB_REG_GPIO_45_SMT                                     (1<<1U)
#define GLB_REG_GPIO_45_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_45_DRV_MASK                                (0x3<<GLB_REG_GPIO_45_DRV_SHIFT)
#define GLB_REG_GPIO_45_PU                                      (1<<4U)
#define GLB_REG_GPIO_45_PD                                      (1<<5U)
#define GLB_REG_GPIO_45_OE                                      (1<<6U)
#define GLB_REG_GPIO_45_FUNC_SEL_SHIFT                          (8U)
#define GLB_REG_GPIO_45_FUNC_SEL_MASK                           (0x1f<<GLB_REG_GPIO_45_FUNC_SEL_SHIFT)
#define GLB_REG_GPIO_45_INT_MODE_SET_SHIFT                      (16U)
#define GLB_REG_GPIO_45_INT_MODE_SET_MASK                       (0xf<<GLB_REG_GPIO_45_INT_MODE_SET_SHIFT)
#define GLB_REG_GPIO_45_INT_CLR                                 (1<<20U)
#define GLB_GPIO_45_INT_STAT                                    (1<<21U)
#define GLB_REG_GPIO_45_INT_MASK                                (1<<22U)
#define GLB_REG_GPIO_45_O                                       (1<<24U)
#define GLB_REG_GPIO_45_SET                                     (1<<25U)
#define GLB_REG_GPIO_45_CLR                                     (1<<26U)
#define GLB_REG_GPIO_45_I                                       (1<<28U)
#define GLB_REG_GPIO_45_MODE_SHIFT                              (30U)
#define GLB_REG_GPIO_45_MODE_MASK                               (0x3<<GLB_REG_GPIO_45_MODE_SHIFT)

/* 0x97C : gpio_cfg46 */
#define GLB_REG_GPIO_46_IE                                      (1<<0U)
#define GLB_REG_GPIO_46_SMT                                     (1<<1U)
#define GLB_REG_GPIO_46_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_46_DRV_MASK                                (0x3<<GLB_REG_GPIO_46_DRV_SHIFT)
#define GLB_REG_GPIO_46_PU                                      (1<<4U)
#define GLB_REG_GPIO_46_PD                                      (1<<5U)

