vladimir-dudnik-1/u-boot/include/bl808/gpio_reg.h
/* 0x980 : gpio_cfg47 */
#define GLB_REG_GPIO_47_IE                                      (1<<0U)
#define GLB_REG_GPIO_47_SMT                                     (1<<1U)
#define GLB_REG_GPIO_47_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_47_DRV_MASK                                (0x3<<GLB_REG_GPIO_47_DRV_SHIFT)
#define GLB_REG_GPIO_47_PU                                      (1<<4U)
#define GLB_REG_GPIO_47_PD                                      (1<<5U)

/* 0x984 : gpio_cfg48 */
#define GLB_REG_GPIO_48_IE                                      (1<<0U)
#define GLB_REG_GPIO_48_SMT                                     (1<<1U)
#define GLB_REG_GPIO_48_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_48_DRV_MASK                                (0x3<<GLB_REG_GPIO_48_DRV_SHIFT)
#define GLB_REG_GPIO_48_PU                                      (1<<4U)
#define GLB_REG_GPIO_48_PD                                      (1<<5U)

/* 0x988 : gpio_cfg49 */
#define GLB_REG_GPIO_49_IE                                      (1<<0U)
#define GLB_REG_GPIO_49_SMT                                     (1<<1U)
#define GLB_REG_GPIO_49_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_49_DRV_MASK                                (0x3<<GLB_REG_GPIO_49_DRV_SHIFT)
#define GLB_REG_GPIO_49_PU                                      (1<<4U)
#define GLB_REG_GPIO_49_PD                                      (1<<5U)

/* 0x98C : gpio_cfg50 */
#define GLB_REG_GPIO_50_IE                                      (1<<0U)
#define GLB_REG_GPIO_50_SMT                                     (1<<1U)
#define GLB_REG_GPIO_50_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_50_DRV_MASK                                (0x3<<GLB_REG_GPIO_50_DRV_SHIFT)
#define GLB_REG_GPIO_50_PU                                      (1<<4U)
#define GLB_REG_GPIO_50_PD                                      (1<<5U)

/* 0x990 : gpio_cfg51 */
#define GLB_REG_GPIO_51_IE                                      (1<<0U)
#define GLB_REG_GPIO_51_SMT                                     (1<<1U)
#define GLB_REG_GPIO_51_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_51_DRV_MASK                                (0x3<<GLB_REG_GPIO_51_DRV_SHIFT)
#define GLB_REG_GPIO_51_PU                                      (1<<4U)
#define GLB_REG_GPIO_51_PD                                      (1<<5U)

/* 0x994 : gpio_cfg52 */
#define GLB_REG_GPIO_52_IE                                      (1<<0U)
#define GLB_REG_GPIO_52_SMT                                     (1<<1U)
#define GLB_REG_GPIO_52_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_52_DRV_MASK                                (0x3<<GLB_REG_GPIO_52_DRV_SHIFT)
#define GLB_REG_GPIO_52_PU                                      (1<<4U)
#define GLB_REG_GPIO_52_PD                                      (1<<5U)

/* 0x998 : gpio_cfg53 */
#define GLB_REG_GPIO_53_IE                                      (1<<0U)
#define GLB_REG_GPIO_53_SMT                                     (1<<1U)
#define GLB_REG_GPIO_53_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_53_DRV_MASK                                (0x3<<GLB_REG_GPIO_53_DRV_SHIFT)
#define GLB_REG_GPIO_53_PU                                      (1<<4U)
#define GLB_REG_GPIO_53_PD                                      (1<<5U)

/* 0x99C : gpio_cfg54 */
#define GLB_REG_GPIO_54_IE                                      (1<<0U)
#define GLB_REG_GPIO_54_SMT                                     (1<<1U)
#define GLB_REG_GPIO_54_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_54_DRV_MASK                                (0x3<<GLB_REG_GPIO_54_DRV_SHIFT)
#define GLB_REG_GPIO_54_PU                                      (1<<4U)
#define GLB_REG_GPIO_54_PD                                      (1<<5U)

/* 0x9A0 : gpio_cfg55 */
#define GLB_REG_GPIO_55_IE                                      (1<<0U)
#define GLB_REG_GPIO_55_SMT                                     (1<<1U)
#define GLB_REG_GPIO_55_DRV_SHIFT                               (2U)
#define GLB_REG_GPIO_55_DRV_MASK                                (0x3<<GLB_REG_GPIO_55_DRV_SHIFT)
#define GLB_REG_GPIO_55_PU                                      (1<<4U)
#define GLB_REG_GPIO_55_PD                                      (1<<5U)

/* 0x9A4 : gpio_cfg56 */

/* 0x9A8 : gpio_cfg57 */

/* 0x9AC : gpio_cfg58 */

/* 0x9B0 : gpio_cfg59 */

/* 0x9B4 : gpio_cfg60 */

/* 0x9B8 : gpio_cfg61 */

/* 0x9BC : gpio_cfg62 */

/* 0x9C0 : gpio_cfg63 */

/* 0xAC4 : gpio_cfg128 */
#define GLB_REG2_GPIO_0_I                                       (1<<0U)
#define GLB_REG2_GPIO_1_I                                       (1<<1U)
#define GLB_REG2_GPIO_2_I                                       (1<<2U)
#define GLB_REG2_GPIO_3_I                                       (1<<3U)
#define GLB_REG2_GPIO_4_I                                       (1<<4U)
#define GLB_REG2_GPIO_5_I                                       (1<<5U)
#define GLB_REG2_GPIO_6_I                                       (1<<6U)
#define GLB_REG2_GPIO_7_I                                       (1<<7U)
#define GLB_REG2_GPIO_8_I                                       (1<<8U)
#define GLB_REG2_GPIO_9_I                                       (1<<9U)
#define GLB_REG2_GPIO_10_I                                      (1<<10U)
#define GLB_REG2_GPIO_11_I                                      (1<<11U)
#define GLB_REG2_GPIO_12_I                                      (1<<12U)
#define GLB_REG2_GPIO_13_I                                      (1<<13U)
#define GLB_REG2_GPIO_14_I                                      (1<<14U)
#define GLB_REG2_GPIO_15_I                                      (1<<15U)
#define GLB_REG2_GPIO_16_I                                      (1<<16U)
#define GLB_REG2_GPIO_17_I                                      (1<<17U)
#define GLB_REG2_GPIO_18_I                                      (1<<18U)
#define GLB_REG2_GPIO_19_I                                      (1<<19U)
#define GLB_REG2_GPIO_20_I                                      (1<<20U)
#define GLB_REG2_GPIO_21_I                                      (1<<21U)
#define GLB_REG2_GPIO_22_I                                      (1<<22U)
#define GLB_REG2_GPIO_23_I                                      (1<<23U)
#define GLB_REG2_GPIO_24_I                                      (1<<24U)
#define GLB_REG2_GPIO_25_I                                      (1<<25U)
#define GLB_REG2_GPIO_26_I                                      (1<<26U)
#define GLB_REG2_GPIO_27_I                                      (1<<27U)
#define GLB_REG2_GPIO_28_I                                      (1<<28U)
#define GLB_REG2_GPIO_29_I                                      (1<<29U)
#define GLB_REG2_GPIO_30_I                                      (1<<30U)
#define GLB_REG2_GPIO_31_I                                      (1<<31U)

/* 0xAC8 : gpio_cfg129 */
#define GLB_REG2_GPIO_32_I                                      (1<<0U)
#define GLB_REG2_GPIO_33_I                                      (1<<1U)
#define GLB_REG2_GPIO_34_I                                      (1<<2U)
#define GLB_REG2_GPIO_35_I                                      (1<<3U)
#define GLB_REG2_GPIO_36_I                                      (1<<4U)
#define GLB_REG2_GPIO_37_I                                      (1<<5U)
#define GLB_REG2_GPIO_38_I                                      (1<<6U)
#define GLB_REG2_GPIO_39_I                                      (1<<7U)
#define GLB_REG2_GPIO_40_I                                      (1<<8U)
#define GLB_REG2_GPIO_41_I                                      (1<<9U)
#define GLB_REG2_GPIO_42_I                                      (1<<10U)
#define GLB_REG2_GPIO_43_I                                      (1<<11U)
#define GLB_REG2_GPIO_44_I                                      (1<<12U)
#define GLB_REG2_GPIO_45_I                                      (1<<13U)

/* 0xAE4 : gpio_cfg136 */
#define GLB_REG2_GPIO_0_O                                       (1<<0U)
#define GLB_REG2_GPIO_1_O                                       (1<<1U)
#define GLB_REG2_GPIO_2_O                                       (1<<2U)
#define GLB_REG2_GPIO_3_O                                       (1<<3U)
#define GLB_REG2_GPIO_4_O                                       (1<<4U)
#define GLB_REG2_GPIO_5_O                                       (1<<5U)
#define GLB_REG2_GPIO_6_O                                       (1<<6U)
#define GLB_REG2_GPIO_7_O                                       (1<<7U)
#define GLB_REG2_GPIO_8_O                                       (1<<8U)
#define GLB_REG2_GPIO_9_O                                       (1<<9U)
#define GLB_REG2_GPIO_10_O                                      (1<<10U)
#define GLB_REG2_GPIO_11_O                                      (1<<11U)
#define GLB_REG2_GPIO_12_O                                      (1<<12U)
#define GLB_REG2_GPIO_13_O                                      (1<<13U)
#define GLB_REG2_GPIO_14_O                                      (1<<14U)
#define GLB_REG2_GPIO_15_O                                      (1<<15U)
#define GLB_REG2_GPIO_16_O                                      (1<<16U)
#define GLB_REG2_GPIO_17_O                                      (1<<17U)
#define GLB_REG2_GPIO_18_O                                      (1<<18U)
#define GLB_REG2_GPIO_19_O                                      (1<<19U)
#define GLB_REG2_GPIO_20_O                                      (1<<20U)
#define GLB_REG2_GPIO_21_O                                      (1<<21U)
#define GLB_REG2_GPIO_22_O                                      (1<<22U)
#define GLB_REG2_GPIO_23_O                                      (1<<23U)
#define GLB_REG2_GPIO_24_O                                      (1<<24U)
#define GLB_REG2_GPIO_25_O                                      (1<<25U)
#define GLB_REG2_GPIO_26_O                                      (1<<26U)
#define GLB_REG2_GPIO_27_O                                      (1<<27U)
#define GLB_REG2_GPIO_28_O                                      (1<<28U)
#define GLB_REG2_GPIO_29_O                                      (1<<29U)
#define GLB_REG2_GPIO_30_O                                      (1<<30U)
#define GLB_REG2_GPIO_31_O                                      (1<<31U)

/* 0xAE8 : gpio_cfg137 */
#define GLB_REG2_GPIO_32_O                                      (1<<0U)
#define GLB_REG2_GPIO_33_O                                      (1<<1U)
#define GLB_REG2_GPIO_34_O                                      (1<<2U)
#define GLB_REG2_GPIO_35_O                                      (1<<3U)
#define GLB_REG2_GPIO_36_O                                      (1<<4U)
#define GLB_REG2_GPIO_37_O                                      (1<<5U)
#define GLB_REG2_GPIO_38_O                                      (1<<6U)
#define GLB_REG2_GPIO_39_O                                      (1<<7U)
#define GLB_REG2_GPIO_40_O                                      (1<<8U)
#define GLB_REG2_GPIO_41_O                                      (1<<9U)
#define GLB_REG2_GPIO_42_O                                      (1<<10U)
#define GLB_REG2_GPIO_43_O                                      (1<<11U)
#define GLB_REG2_GPIO_44_O                                      (1<<12U)
#define GLB_REG2_GPIO_45_O                                      (1<<13U)

/* 0xAEC : gpio_cfg138 */
#define GLB_REG2_GPIO_0_SET                                     (1<<0U)
#define GLB_REG2_GPIO_1_SET                                     (1<<1U)
#define GLB_REG2_GPIO_2_SET                                     (1<<2U)
#define GLB_REG2_GPIO_3_SET                                     (1<<3U)
#define GLB_REG2_GPIO_4_SET                                     (1<<4U)
#define GLB_REG2_GPIO_5_SET                                     (1<<5U)
#define GLB_REG2_GPIO_6_SET                                     (1<<6U)
#define GLB_REG2_GPIO_7_SET                                     (1<<7U)
#define GLB_REG2_GPIO_8_SET                                     (1<<8U)
#define GLB_REG2_GPIO_9_SET                                     (1<<9U)
#define GLB_REG2_GPIO_10_SET                                    (1<<10U)
#define GLB_REG2_GPIO_11_SET                                    (1<<11U)
#define GLB_REG2_GPIO_12_SET                                    (1<<12U)
#define GLB_REG2_GPIO_13_SET                                    (1<<13U)
#define GLB_REG2_GPIO_14_SET                                    (1<<14U)
#define GLB_REG2_GPIO_15_SET                                    (1<<15U)
#define GLB_REG2_GPIO_16_SET                                    (1<<16U)
#define GLB_REG2_GPIO_17_SET                                    (1<<17U)
#define GLB_REG2_GPIO_18_SET                                    (1<<18U)
#define GLB_REG2_GPIO_19_SET                                    (1<<19U)
#define GLB_REG2_GPIO_20_SET                                    (1<<20U)
#define GLB_REG2_GPIO_21_SET                                    (1<<21U)
#define GLB_REG2_GPIO_22_SET                                    (1<<22U)
#define GLB_REG2_GPIO_23_SET                                    (1<<23U)
#define GLB_REG2_GPIO_24_SET                                    (1<<24U)
#define GLB_REG2_GPIO_25_SET                                    (1<<25U)
#define GLB_REG2_GPIO_26_SET                                    (1<<26U)
#define GLB_REG2_GPIO_27_SET                                    (1<<27U)
#define GLB_REG2_GPIO_28_SET                                    (1<<28U)
#define GLB_REG2_GPIO_29_SET                                    (1<<29U)
#define GLB_REG2_GPIO_30_SET                                    (1<<30U)
#define GLB_REG2_GPIO_31_SET                                    (1<<31U)

/* 0xAF0 : gpio_cfg139 */
#define GLB_REG2_GPIO_32_SET                                    (1<<0U)
#define GLB_REG2_GPIO_33_SET                                    (1<<1U)
#define GLB_REG2_GPIO_34_SET                                    (1<<2U)
#define GLB_REG2_GPIO_35_SET                                    (1<<3U)
#define GLB_REG2_GPIO_36_SET                                    (1<<4U)
#define GLB_REG2_GPIO_37_SET                                    (1<<5U)
#define GLB_REG2_GPIO_38_SET                                    (1<<6U)
#define GLB_REG2_GPIO_39_SET                                    (1<<7U)
#define GLB_REG2_GPIO_40_SET                                    (1<<8U)
#define GLB_REG2_GPIO_41_SET                                    (1<<9U)
#define GLB_REG2_GPIO_42_SET                                    (1<<10U)
#define GLB_REG2_GPIO_43_SET                                    (1<<11U)
#define GLB_REG2_GPIO_44_SET                                    (1<<12U)
#define GLB_REG2_GPIO_45_SET                                    (1<<13U)

/* 0xAEC : gpio_cfg140 */
#define GLB_REG2_GPIO_0_CLR                                     (1<<0U)
#define GLB_REG2_GPIO_1_CLR                                     (1<<1U)
#define GLB_REG2_GPIO_2_CLR                                     (1<<2U)
#define GLB_REG2_GPIO_3_CLR                                     (1<<3U)
#define GLB_REG2_GPIO_4_CLR                                     (1<<4U)
#define GLB_REG2_GPIO_5_CLR                                     (1<<5U)
#define GLB_REG2_GPIO_6_CLR                                     (1<<6U)
#define GLB_REG2_GPIO_7_CLR                                     (1<<7U)
#define GLB_REG2_GPIO_8_CLR                                     (1<<8U)
#define GLB_REG2_GPIO_9_CLR                                     (1<<9U)
#define GLB_REG2_GPIO_10_CLR                                    (1<<10U)
#define GLB_REG2_GPIO_11_CLR                                    (1<<11U)
#define GLB_REG2_GPIO_12_CLR                                    (1<<12U)
#define GLB_REG2_GPIO_13_CLR                                    (1<<13U)
#define GLB_REG2_GPIO_14_CLR                                    (1<<14U)
#define GLB_REG2_GPIO_15_CLR                                    (1<<15U)
#define GLB_REG2_GPIO_16_CLR                                    (1<<16U)
#define GLB_REG2_GPIO_17_CLR                                    (1<<17U)
#define GLB_REG2_GPIO_18_CLR                                    (1<<18U)
#define GLB_REG2_GPIO_19_CLR                                    (1<<19U)
#define GLB_REG2_GPIO_20_CLR                                    (1<<20U)
#define GLB_REG2_GPIO_21_CLR                                    (1<<21U)
#define GLB_REG2_GPIO_22_CLR                                    (1<<22U)
#define GLB_REG2_GPIO_23_CLR                                    (1<<23U)
#define GLB_REG2_GPIO_24_CLR                                    (1<<24U)
#define GLB_REG2_GPIO_25_CLR                                    (1<<25U)
#define GLB_REG2_GPIO_26_CLR                                    (1<<26U)
#define GLB_REG2_GPIO_27_CLR                                    (1<<27U)
#define GLB_REG2_GPIO_28_CLR                                    (1<<28U)
#define GLB_REG2_GPIO_29_CLR                                    (1<<29U)
#define GLB_REG2_GPIO_30_CLR                                    (1<<30U)
#define GLB_REG2_GPIO_31_CLR                                    (1<<31U)

