vladimir-dudnik-1/u-boot/include/bl808/gpio_reg.h
/* 0xAF8 : gpio_cfg141 */
#define GLB_REG2_GPIO_32_CLR                                    (1<<0U)
#define GLB_REG2_GPIO_33_CLR                                    (1<<1U)
#define GLB_REG2_GPIO_34_CLR                                    (1<<2U)
#define GLB_REG2_GPIO_35_CLR                                    (1<<3U)
#define GLB_REG2_GPIO_36_CLR                                    (1<<4U)
#define GLB_REG2_GPIO_37_CLR                                    (1<<5U)
#define GLB_REG2_GPIO_38_CLR                                    (1<<6U)
#define GLB_REG2_GPIO_39_CLR                                    (1<<7U)
#define GLB_REG2_GPIO_40_CLR                                    (1<<8U)
#define GLB_REG2_GPIO_41_CLR                                    (1<<9U)
#define GLB_REG2_GPIO_42_CLR                                    (1<<10U)
#define GLB_REG2_GPIO_43_CLR                                    (1<<11U)
#define GLB_REG2_GPIO_44_CLR                                    (1<<12U)
#define GLB_REG2_GPIO_45_CLR                                    (1<<13U)

/* 0xAFC : gpio_cfg142 */
#define GLB_CR_GPIO_TX_EN                                       (1<<0U)
#define GLB_CR_INVERT_CODE0_HIGH                                (1<<1U)
#define GLB_CR_INVERT_CODE1_HIGH                                (1<<2U)
#define GLB_CR_CODE_TOTAL_TIME_SHIFT                            (7U)
#define GLB_CR_CODE_TOTAL_TIME_MASK                             (0x1ff<<GLB_CR_CODE_TOTAL_TIME_SHIFT)
#define GLB_CR_CODE0_HIGH_TIME_SHIFT                            (16U)
#define GLB_CR_CODE0_HIGH_TIME_MASK                             (0xff<<GLB_CR_CODE0_HIGH_TIME_SHIFT)
#define GLB_CR_CODE1_HIGH_TIME_SHIFT                            (24U)
#define GLB_CR_CODE1_HIGH_TIME_MASK                             (0xff<<GLB_CR_CODE1_HIGH_TIME_SHIFT)

/* 0xB00 : gpio_cfg143 */
#define GLB_CR_GPIO_DMA_TX_EN                                   (1<<0U)
#define GLB_CR_GPIO_DMA_OUT_SEL_LATCH                           (1<<1U)
#define GLB_GPIO_TX_FIFO_CLR                                    (1<<2U)
#define GLB_GPIO_TX_END_CLR                                     (1<<3U)
#define GLB_GPIO_TX_FIFO_OVERFLOW                               (1<<4U)
#define GLB_GPIO_TX_FIFO_UNDERFLOW                              (1<<5U)
#define GLB_CR_GPIO_DMA_PARK_VALUE                              (1<<7U)
#define GLB_GPIO_TX_FIFO_CNT_SHIFT                              (8U)
#define GLB_GPIO_TX_FIFO_CNT_MASK                               (0xff<<GLB_GPIO_TX_FIFO_CNT_SHIFT)
#define GLB_CR_GPIO_TX_FIFO_TH_SHIFT                            (16U)
#define GLB_CR_GPIO_TX_FIFO_TH_MASK                             (0x7f<<GLB_CR_GPIO_TX_FIFO_TH_SHIFT)
#define GLB_CR_GPIO_TX_END_MASK                                 (1<<23U)
#define GLB_CR_GPIO_TX_FIFO_MASK                                (1<<24U)
#define GLB_CR_GPIO_TX_FER_MASK                                 (1<<25U)
#define GLB_R_GPIO_TX_END_INT                                   (1<<26U)
#define GLB_R_GPIO_TX_FIFO_INT                                  (1<<27U)
#define GLB_R_GPIO_TX_FER_INT                                   (1<<28U)
#define GLB_CR_GPIO_TX_END_EN                                   (1<<29U)
#define GLB_CR_GPIO_TX_FIFO_EN                                  (1<<30U)
#define GLB_CR_GPIO_TX_FER_EN                                   (1<<31U)

/* 0xB04 : gpio_cfg144 */
#define GLB_GPIO_TX_DATA_TO_FIFO_SHIFT                          (0U)
#define GLB_GPIO_TX_DATA_TO_FIFO_MASK                           (0xffff<<GLB_GPIO_TX_DATA_TO_FIFO_SHIFT)

#endif




/* __HARDWARE_GPIO_H__ */
